In [81]:
#importing necessary module

import pandas as pd
import numpy as np
%load_ext autoreload
%autoreload 2
import warnings
warnings.filterwarnings('ignore')
import seaborn as sns

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [82]:
#reading dataset

data=pd.read_csv('/Users/bibekrai/workspace/College/Data.csv')

In [83]:
data=data.drop(columns={'Unnamed: 0'})

In [84]:
data.isnull()

,College,Location,University,Course Offered,Ownership Type,Phone Number,Email
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
1372,False,False,False,False,False,True,True
1373,False,False,False,False,False,True,True
1374,False,False,False,False,False,False,False
1375,False,False,False,False,False,True,True
1376,False,False,False,False,False,True,True

In [85]:
data.isnull().sum()

College              0
Location             2
University          20
Course Offered       0
Ownership Type      35
Phone Number       742
Email             1001
dtype: int64

In [86]:
data['Location']=data['Location'].fillna('null')
data['University']=data['University'].fillna('null')
data['Ownership Type']=data['Ownership Type'].fillna('null')
data['Phone Number']=data['Phone Number'].fillna('null')
data['Email']=data['Email'].fillna('null')

In [87]:
data.describe()

,College,Location,University,Course Offered,Ownership Type,Phone Number,Email
count,1377,1377,1377,1377,1377,1377,1377
unique,1310,978,43,702,5,603,354
top,Suprabhat College,"Kirtipur, Kathmandu",Tribhuvan University,Bachelor of Education\n (BEd),private Institution,null,null
freq,5,42,847,128,557,742,1001

In [88]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1377 entries, 0 to 1376
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   College         1377 non-null   object
 1   Location        1377 non-null   object
 2   University      1377 non-null   object
 3   Course Offered  1377 non-null   object
 4   Ownership Type  1377 non-null   object
 5   Phone Number    1377 non-null   object
 6   Email           1377 non-null   object
dtypes: object(7)
memory usage: 75.4+ KB

In [89]:
data.columns

Index(['College', 'Location', 'University', 'Course Offered', 'Ownership Type',
       'Phone Number', 'Email'],
      dtype='object')

In [90]:
data.columns.value_counts()

College           1
Location          1
University        1
Course Offered    1
Ownership Type    1
Phone Number      1
Email             1
dtype: int64

In [91]:
data.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1372    False
1373    False
1374    False
1375    False
1376    False
Length: 1377, dtype: bool

In [92]:
data.dtypes

College           object
Location          object
University        object
Course Offered    object
Ownership Type    object
Phone Number      object
Email             object
dtype: object

In [93]:
data['College'].value_counts()

Suprabhat College                                         5
​Indreni Campus                                           5
Jagannath Multiple Campus                                 4
Sciences School of Nursing | Karnali Academy of Health    3
CIST College                                              3
                                                         ..
Sarlahi Campus                                            1
Nava Prabhat Campus                                       1
​Sindhu Valley Campus                                     1
Laxmi Adarsha Multiple Campus                             1
College of Applied Business                               1
Name: College, Length: 1310, dtype: int64

In [94]:
data['Location'].value_counts()

Kirtipur, Kathmandu                 42
Biratnagar, Morang                  22
Kumaripati, Lalitpur                12
Dharan, Sunsari                     11
Bharatpur, Chitwan                  11
                                    ..
Shantipur, Chandrakot, Gulmi         1
Darma, Salyan                        1
Deumai, Ilam                         1
Dakaha, Dudhouli, Sindhuli           1
Gangahity, Dhobikhola, Kathmandu     1
Name: Location, Length: 978, dtype: int64

In [95]:
data['Course Offered'].value_counts()

Bachelor of Education\n        (BEd)                                                                                                                                                                                                                                                                                                                                                                      128
Bachelor of Business Studies\n        (BBS)                                                                                                                                                                                                                                                                                                                                                               121
Bachelor of Business Studies\n        (BBS)\n Bachelor of Education\n        (BEd)                                                                                                                                                                                                                                                                                                                         92
Bachelor of Education\n        (BEd)\n Bachelor of Business Studies\n        (BBS)                                                                                                                                                                                                                                                                                                                         83
BSc Agriculture\n        (B.Sc Ag)                                                                                                                                                                                                                                                                                                                                                                         15
                                                                                                                                                                                                                                                                                                                                                                                                         ...
Bachelor of Business Studies\n        (BBS)\n Ten Plus Two (+2) Science\n        (+2 Science)\n Ten Plus Two (+2) Management\n        (+2 Mangement)\n Ten Plus Two (+2) Humanities\n        (+2 Humanities)                                                                                                                                                                                                1
Bachelor of Business Administration\n        (BBA)\n Executive MBA\n        (EMBA)                                                                                                                                                                                                                                                                                                                          1
Ten Plus Two (+2) Management\n        (+2 Mangement)\n Ten Plus Two (+2) Science\n        (+2 Science)\n Ten Plus Two (+2) Humanities\n        (+2 Humanities)\n Bachelor of Arts\n        (BA)\n Bachelor of Business Studies\n        (BBS)\n Bachelor of Arts in Social Work\n        (BASW)\n Bachelor of Computer Application\n        (BCA)\n Bachelor in Hospitality Management\n        (BHM)       1
Bachelor of Arts\n        (BA)\n Bachelor of Education\n        (BEd)\n Bachelor of Business Studies\n        (BBS)\n Master of Business Studies\n        (MBS)\n MA in Sociology\n MA in Anthropology\n        (MA Anthropology)\n Ten Plus Two (+2) Humanities\n        (+2 Humanities)\n Ten Plus Two (+2) Education\n        (+2 Education)\n Ten Plus Two (+2) Management\n        (+2 Mangement)      1
Bachelor of Business Administration\n        (BBA)\n Bachelor of Information Management\n        (BIM)\n BSc Computer Science and Information Technology\n        (BSc CSIT)\n Bachelor of Business Studies\n        (BBS)\n Bachelor of Computer Application\n        (BCA)                                                                                                                                1
Name: Course Offered, Length: 702, dtype: int64

In [96]:
data['University'].value_counts()

Tribhuvan University                                       847
National Examinations Board                                180
Purbanchal University                                       80
Pokhara University                                          67
Council for Technical Education and Vocational Training     24
Kathmandu University                                        22
Nepal Sanskrit University                                   21
null                                                        20
Agriculture and Forestry University                         20
Far-Western University                                      13
Mid-West University                                         12
Lumbini Buddhist University                                 10
Lincoln University College                                  10
ACCA                                                         5
Karnali Academy of Health Sciences                           5
Manmohan Technical University                                3
Asia Pacific University of Technology & Innovation           3
University of Sunderland                                     3
Patan Academy of Health Sciences                             3
Indira Gandhi National Open University                       2
London Metropolitan University                               2
University of Wolverhampton                                  2
The Institute of Chartered Accountants of Nepal              2
Westcliff University, CA, USA                                2
​Infrastructure University Kuala Lumpur                      1
Cambridge GCE A Levels                                       1
Coventry University, UK                                      1
Nilai University, Malaysia                                   1
International Teaching University of Georgia                 1
Salzburg University of Applied Sciences                      1
Delta International University                               1
SIAM University, Thailand                                    1
Asia e University                                            1
UCSI University                                              1
HELP University                                              1
American Hospitality Academy, USA                            1
Limkokwing University, Malaysia                              1
Taylor's University, Malaysia                                1
University of Bedfordshire                                   1
EHE European University, EurAka, Switzerland                 1
BPKIHS                                                       1
​Oxford Brookes University                                   1
Ecole hôtelière de Lausanne                                  1
Name: University, dtype: int64

In [97]:
data['Ownership Type'].value_counts()

private Institution        557
community Institution      460
constituent Institution    173
public Institution         152
null                        35
Name: Ownership Type, dtype: int64

In [98]:
data['Email'].value_counts()

null                                  1001
suprabhatcollege@gmail.com               5
info@kahs.edu.np                         5
ghanteshor@fwu.edu.np                    3
info@mtu.edu.np                          3
                                      ...
info@ncc.edu.np                          1
trichandramultiplecampus@gmail.com       1
info@pkcampus.edu.np                     1
info@bmc.edu.np                          1
info@pusob.edu.np                        1
Name: Email, Length: 354, dtype: int64

In [99]:
data['Phone Number'].value_counts()

null                        742
087-520115,  087- 520355      5
095-520170                    4
974701203                     3
09952400                      3
                           ...
083-521315, 9848085540        1
056-591655, 056-591777        1
9852084222                    1
061-461168                    1
061-504147 , 061-504035       1
Name: Phone Number, Length: 603, dtype: int64

In [100]:
sns.pairplot(data,palette='viridis',markers='*',height=2.5,kind='scatter')

ValueError: No variables found for grid columns.